#ifndef __FILTER_MIDDLEWARE_H__
#define __FILTER_MIDDLEWARE_H__
/* ======================== 头文件 ========================================== */



/* ======================== 宏定义 ========================================== */



/* ======================== 自定义类型 ====================================== */
typedef struct {
    float P_; 	 // 上次估算协方差
    float P;     // 当前估算协方差
    float out;   // 卡尔曼滤波器输出
    float K;     // 卡尔曼增益
    float Q;     // 过程噪声协方差
    float R;     // 测量噪声协方差
} kfp_t;



/* ======================== 接口声明区 ====================================== */
void vFilter_Init(void);


#endif /* __FILTER_MIDDLEWARE_H__ */
