#ifndef __SYSTICK_H__
#define __SYSTICK_H__

/* ======================== 头文件 ========================================== */
#include "stm32f0xx.h"



/* ======================== 宏定义 ========================================== */



/* ======================== 自定义类型 ====================================== */



/* ======================== 接口声明区 ====================================== */
void vTaskScheduleCbReg(void (*pFunc)(void));
void vSystickInit(void);
uint64_t ulSysRunTimeGet(void);


#endif /* __SYSTICK_H__ */
